#include <stdio.h>
int main() {
	printf("%s [%s]\n", "\t\t", "영 수 증");
	printf("\n");
	printf("[%3s] %s %s\n","매장명", "백년식당", "서서갈비" );
	printf("[%3s] %3d%c%2d%c%5d\n","사업자", 122, '-', 35, '-', 72470);
	printf("[%3s] %s %s %s%d%s %d\n","주  소", "인천광역시", "계양구", "장제로",875,"번길", 7);
	printf("%s(%s%c%s) %d%s\n", " ", "임학동",'\,'," 금광포란재아파트", 101,"호");
	printf("[%3s] %-12s [%s] %03d%c%d%c%d\n","대표자", "이원옥", "TEL", 32, '-', 551, '-', 9279);
	printf("[%3s] %4d%c%02d%c%2d %02d%c%02d%c%02d     %02d%c%s\n","매출일", 2017, '-', 3, '-', 27, 16, ':', 47, ':', 33, 1, '-', "이원옥");
	printf("[%3s] %4d%02d%2d%c%02d%c%04d\n","영수증", 2017,3,27,'-',1,'-',5);
	printf("==========================================\n");
	printf("%14s %9s %7s %9s\n", "상  품  명", "단 가", "수량", "금 액");
	printf("------------------------------------------\n");
	printf("%s\n", "돼지맛갈비");
	printf("%06d %13d%c%.3d %6d %6d%c%3d\n", 1,7, ',', 900, 6, 47, ',', 400 );
	printf("%s\n", "상차림");
	printf("%06d %13d%c%.3d %6d %6d%c%.3d\n", 23,1, ',', .0, 2, 2, ',', .0 );
	printf("%s\n", "공기밥");
	printf("%06d %13d%c%.3d %6d %6d%c%.3d\n", 15,1, ',', .0, 1, 1, ',', .0 );
	printf("%s\n", "된장찌개");
	printf("%06d %13d%c%.3d %6d %6d%c%.3d\n", 14,1, ',', .0, 1, 1, ',', .0 );
	printf("%s\n", "비빔냉면");
	printf("%06d %13d%c%.3d %6d %6d%c%.3d\n", 12,6, ',', .0, 1, 6, ',', .0 );
	printf("%s\n", "물냉면");
	printf("%06d %13d%c%.3d %6d %6d%c%.3d\n", 13,6, ',', .0, 1, 6, ',', .0 );
	printf("------------------------------------------\n");
	printf("%s %26d%c%.3d\n", "합 계 금 액",63,',',400 );
	printf("------------------------------------------\n");
	printf("%25s %12d%c%.3d\n", "면세물품가액",57,',',641 );
	printf("%25s %12d%c%.3d\n", "과세물품가액",5,',',183 );
	printf("%25s %16d\n", "부   과   세",576 );
	printf("------------------------------------------\n");
	printf("%25s %12d%c%.3d\n", "총  합계액",63,',',400 );
	printf("%25s %12d%c%.3d\n", "결  재  액",63,',',400 );
	printf("------------------------------------------\n");
	printf("%25s %12d%c%.3d\n", "받은현금 :",63,',',400 );
	
} 
